note/drawio/converted/dot/260421-asm.dot
digraph G {
  graph [rankdir=LR];
  node [shape=box, style="rounded,filled", fillcolor="#f8f9fb", color="#5b6b7a", fontname="Arial"];
  "n_2hiasUPIRgNUq5fgBpaz_12" [label="TX = 1bit_cnt = 0"];
  "n_2hiasUPIRgNUq5fgBpaz_14" [label="i_tx_start == 1"];
  "n_2hiasUPIRgNUq5fgBpaz_16" [label="data_reg = i_tx_data"];
  "n_2hiasUPIRgNUq5fgBpaz_18" [label="START"];
  "n_2hiasUPIRgNUq5fgBpaz_22" [label="False"];
  "n_2hiasUPIRgNUq5fgBpaz_23" [label="True"];
  "n_2hiasUPIRgNUq5fgBpaz_24" [label="TX = 0"];
  "n_2hiasUPIRgNUq5fgBpaz_26" [label="i_b_tick == 1"];
  "n_2hiasUPIRgNUq5fgBpaz_28" [label="DATA"];
  "n_2hiasUPIRgNUq5fgBpaz_30" [label="True"];
  "n_2hiasUPIRgNUq5fgBpaz_31" [label="TX = data_reg[bit_cnt]"];
  "n_2hiasUPIRgNUq5fgBpaz_33" [label="i_b_tick == 1"];
  "n_2hiasUPIRgNUq5fgBpaz_35" [label="bit_cnt == 7"];
  "n_2hiasUPIRgNUq5fgBpaz_38" [label="False"];
  "n_2hiasUPIRgNUq5fgBpaz_39" [label="bit_cnt++"];
  "n_2hiasUPIRgNUq5fgBpaz_41" [label="True"];
  "n_2hiasUPIRgNUq5fgBpaz_42" [label="False"];
  "n_2hiasUPIRgNUq5fgBpaz_46" [label="bit_cnt = 0"];
  "n_2hiasUPIRgNUq5fgBpaz_49" [label="STOP"];
  "n_2hiasUPIRgNUq5fgBpaz_51" [label="TX = 1"];
  "n_2hiasUPIRgNUq5fgBpaz_55" [label="i_b_tick == 1"];
  "n_2hiasUPIRgNUq5fgBpaz_58" [label="False"];
  "n_2hiasUPIRgNUq5fgBpaz_60" [label="True"];
  "n_UoZTmbrcyOv7tkDtMk2t_13" [label="start == 1"];
  "n_UoZTmbrcyOv7tkDtMk2t_15" [label="START"];
  "n_UoZTmbrcyOv7tkDtMk2t_2" [label="IDLE"];
  "n_UoZTmbrcyOv7tkDtMk2t_22" [label="False"];
  "n_UoZTmbrcyOv7tkDtMk2t_23" [label="Ture"];
  "n_UoZTmbrcyOv7tkDtMk2t_24" [label="TX = 0"];
  "n_UoZTmbrcyOv7tkDtMk2t_55" [label="i=0data[8:0]"];
  "n_UoZTmbrcyOv7tkDtMk2t_58" [label="btick==1"];
  "n_UoZTmbrcyOv7tkDtMk2t_60" [label="TX=data[0]"];
  "n_UoZTmbrcyOv7tkDtMk2t_62" [label="btick==1"];
  "n_UoZTmbrcyOv7tkDtMk2t_63" [label="i++"];
  "n_UoZTmbrcyOv7tkDtMk2t_64" [label="bit[0]"];
  "n_UoZTmbrcyOv7tkDtMk2t_69" [label="TX=data[i]"];
  "n_UoZTmbrcyOv7tkDtMk2t_70" [label="bit[i]"];
  "n_UoZTmbrcyOv7tkDtMk2t_73" [label="True"];
  "n_UoZTmbrcyOv7tkDtMk2t_77" [label="i == 8"];
  "n_UoZTmbrcyOv7tkDtMk2t_82" [label="True"];
  "n_UoZTmbrcyOv7tkDtMk2t_84" [label="False"];
  "n_UoZTmbrcyOv7tkDtMk2t_85" [label="btick==1"];
  "n_UoZTmbrcyOv7tkDtMk2t_86" [label="STOP"];
  "n_UoZTmbrcyOv7tkDtMk2t_88" [label="True"];
  "n_UoZTmbrcyOv7tkDtMk2t_92" [label="TX=1"];
  "n_UoZTmbrcyOv7tkDtMk2t_94" [label="btick==1"];
  "n_Z8cy0SIaxi_QjKJotWLw_100" [label="False"];
  "n_Z8cy0SIaxi_QjKJotWLw_101" [label="baud_tick == 1"];
  "n_Z8cy0SIaxi_QjKJotWLw_103" [label="bit6"];
  "n_Z8cy0SIaxi_QjKJotWLw_105" [label="TX = data[6]"];
  "n_Z8cy0SIaxi_QjKJotWLw_107" [label="False"];
  "n_Z8cy0SIaxi_QjKJotWLw_108" [label="bit7"];
  "n_Z8cy0SIaxi_QjKJotWLw_110" [label="True"];
  "n_Z8cy0SIaxi_QjKJotWLw_111" [label="baud_tick == 1"];
  "n_Z8cy0SIaxi_QjKJotWLw_113" [label="TX = data[7]"];
  "n_Z8cy0SIaxi_QjKJotWLw_116" [label="True"];
  "n_Z8cy0SIaxi_QjKJotWLw_118" [label="False"];
  "n_Z8cy0SIaxi_QjKJotWLw_119" [label="baud_tick == 1"];
  "n_Z8cy0SIaxi_QjKJotWLw_121" [label="STOP"];
  "n_Z8cy0SIaxi_QjKJotWLw_123" [label="TX = 1"];
  "n_Z8cy0SIaxi_QjKJotWLw_125" [label="False"];
  "n_Z8cy0SIaxi_QjKJotWLw_128" [label="True"];
  "n_Z8cy0SIaxi_QjKJotWLw_129" [label="baud_tick == 1"];
  "n_Z8cy0SIaxi_QjKJotWLw_20" [label="TX = data[1]"];
  "n_Z8cy0SIaxi_QjKJotWLw_23" [label="True"];
  "n_Z8cy0SIaxi_QjKJotWLw_25" [label="False"];
  "n_Z8cy0SIaxi_QjKJotWLw_26" [label="baud_tick == 1"];
  "n_Z8cy0SIaxi_QjKJotWLw_28" [label="bit2"];
  "n_Z8cy0SIaxi_QjKJotWLw_30" [label="TX = data[2]"];
  "n_Z8cy0SIaxi_QjKJotWLw_32" [label="False"];
  "n_Z8cy0SIaxi_QjKJotWLw_33" [label="bit3"];
  "n_Z8cy0SIaxi_QjKJotWLw_35" [label="True"];
  "n_Z8cy0SIaxi_QjKJotWLw_36" [label="baud_tick == 1"];
  "n_Z8cy0SIaxi_QjKJotWLw_77" [label="TX = data[3]"];
  "n_Z8cy0SIaxi_QjKJotWLw_80" [label="True"];
  "n_Z8cy0SIaxi_QjKJotWLw_82" [label="False"];
  "n_Z8cy0SIaxi_QjKJotWLw_83" [label="baud_tick == 1"];
  "n_Z8cy0SIaxi_QjKJotWLw_85" [label="bit4"];
  "n_Z8cy0SIaxi_QjKJotWLw_87" [label="TX = data[4]"];
  "n_Z8cy0SIaxi_QjKJotWLw_89" [label="False"];
  "n_Z8cy0SIaxi_QjKJotWLw_90" [label="bit5"];
  "n_Z8cy0SIaxi_QjKJotWLw_92" [label="True"];
  "n_Z8cy0SIaxi_QjKJotWLw_93" [label="baud_tick == 1"];
  "n_Z8cy0SIaxi_QjKJotWLw_95" [label="TX = data[5]"];
  "n_Z8cy0SIaxi_QjKJotWLw_98" [label="True"];
  "n_kM2_0921JKwGd9c51KsA_1" [label="TX=0"];
  "n_nQHYzv7olxwLTFIKdGA2_2" [label="IDLE"];
  "n_zN6g8_zkIhvAV65zujq3_1" [label="IDLE"];
  "n_zN6g8_zkIhvAV65zujq3_139" [label="baud_tick == 1"];
  "n_zN6g8_zkIhvAV65zujq3_143" [label="True"];
  "n_zN6g8_zkIhvAV65zujq3_34" [label="TX = 1"];
  "n_zN6g8_zkIhvAV65zujq3_36" [label="start == 1"];
  "n_zN6g8_zkIhvAV65zujq3_38" [label="WAIT"];
  "n_zN6g8_zkIhvAV65zujq3_40" [label="baud_tick == 1"];
  "n_zN6g8_zkIhvAV65zujq3_42" [label="START"];
  "n_zN6g8_zkIhvAV65zujq3_46" [label="TX = 0"];
  "n_zN6g8_zkIhvAV65zujq3_50" [label="baud_tick == 1"];
  "n_zN6g8_zkIhvAV65zujq3_51" [label="bit0"];
  "n_zN6g8_zkIhvAV65zujq3_54" [label="False"];
  "n_zN6g8_zkIhvAV65zujq3_55" [label="True"];
  "n_zN6g8_zkIhvAV65zujq3_56" [label="False"];
  "n_zN6g8_zkIhvAV65zujq3_58" [label="TX = data[0]"];
  "n_zN6g8_zkIhvAV65zujq3_63" [label="bit1"];
  "n_zN6g8_zkIhvAV65zujq3_70" [label="False"];
  "n_zN6g8_zkIhvAV65zujq3_72" [label="True"];
  "n_zN6g8_zkIhvAV65zujq3_74" [label="False"];
  "n_UoZTmbrcyOv7tkDtMk2t_13" -> "n_UoZTmbrcyOv7tkDtMk2t_15";
  "n_UoZTmbrcyOv7tkDtMk2t_15" -> "n_UoZTmbrcyOv7tkDtMk2t_24";
  "n_UoZTmbrcyOv7tkDtMk2t_13" -> "n_UoZTmbrcyOv7tkDtMk2t_2";
  "n_UoZTmbrcyOv7tkDtMk2t_24" -> "n_UoZTmbrcyOv7tkDtMk2t_55";
  "n_UoZTmbrcyOv7tkDtMk2t_55" -> "n_UoZTmbrcyOv7tkDtMk2t_58";
  "n_UoZTmbrcyOv7tkDtMk2t_64" -> "n_UoZTmbrcyOv7tkDtMk2t_60";
  "n_UoZTmbrcyOv7tkDtMk2t_58" -> "n_UoZTmbrcyOv7tkDtMk2t_64";
  "n_UoZTmbrcyOv7tkDtMk2t_60" -> "n_UoZTmbrcyOv7tkDtMk2t_62";
  "n_UoZTmbrcyOv7tkDtMk2t_62" -> "n_UoZTmbrcyOv7tkDtMk2t_63";
  "n_UoZTmbrcyOv7tkDtMk2t_69" -> "n_UoZTmbrcyOv7tkDtMk2t_77";
  "n_UoZTmbrcyOv7tkDtMk2t_77" -> "n_UoZTmbrcyOv7tkDtMk2t_62";
  "n_UoZTmbrcyOv7tkDtMk2t_94" -> "n_UoZTmbrcyOv7tkDtMk2t_2";
  "n_nQHYzv7olxwLTFIKdGA2_2" -> "n_2hiasUPIRgNUq5fgBpaz_12";
  "n_2hiasUPIRgNUq5fgBpaz_12" -> "n_2hiasUPIRgNUq5fgBpaz_14";
  "n_2hiasUPIRgNUq5fgBpaz_14" -> "n_2hiasUPIRgNUq5fgBpaz_16";
  "n_2hiasUPIRgNUq5fgBpaz_14" -> "n_nQHYzv7olxwLTFIKdGA2_2";
  "n_2hiasUPIRgNUq5fgBpaz_16" -> "n_2hiasUPIRgNUq5fgBpaz_18";
  "n_2hiasUPIRgNUq5fgBpaz_18" -> "n_2hiasUPIRgNUq5fgBpaz_24";
  "n_2hiasUPIRgNUq5fgBpaz_24" -> "n_2hiasUPIRgNUq5fgBpaz_26";
  "n_2hiasUPIRgNUq5fgBpaz_26" -> "n_2hiasUPIRgNUq5fgBpaz_28";
  "n_2hiasUPIRgNUq5fgBpaz_28" -> "n_2hiasUPIRgNUq5fgBpaz_31";
  "n_2hiasUPIRgNUq5fgBpaz_31" -> "n_2hiasUPIRgNUq5fgBpaz_33";
  "n_2hiasUPIRgNUq5fgBpaz_33" -> "n_2hiasUPIRgNUq5fgBpaz_35";
  "n_2hiasUPIRgNUq5fgBpaz_33" -> "n_2hiasUPIRgNUq5fgBpaz_28";
  "n_2hiasUPIRgNUq5fgBpaz_35" -> "n_2hiasUPIRgNUq5fgBpaz_39";
  "n_2hiasUPIRgNUq5fgBpaz_35" -> "n_2hiasUPIRgNUq5fgBpaz_46";
  "n_2hiasUPIRgNUq5fgBpaz_39" -> "n_2hiasUPIRgNUq5fgBpaz_28";
  "n_2hiasUPIRgNUq5fgBpaz_46" -> "n_2hiasUPIRgNUq5fgBpaz_49";
  "n_2hiasUPIRgNUq5fgBpaz_49" -> "n_2hiasUPIRgNUq5fgBpaz_51";
  "n_2hiasUPIRgNUq5fgBpaz_51" -> "n_2hiasUPIRgNUq5fgBpaz_55";
  "n_2hiasUPIRgNUq5fgBpaz_55" -> "n_2hiasUPIRgNUq5fgBpaz_49";
  "n_2hiasUPIRgNUq5fgBpaz_55" -> "n_nQHYzv7olxwLTFIKdGA2_2";
  "n_zN6g8_zkIhvAV65zujq3_1" -> "n_zN6g8_zkIhvAV65zujq3_34";
  "n_zN6g8_zkIhvAV65zujq3_34" -> "n_zN6g8_zkIhvAV65zujq3_36";
  "n_zN6g8_zkIhvAV65zujq3_36" -> "n_zN6g8_zkIhvAV65zujq3_38";
  "n_zN6g8_zkIhvAV65zujq3_36" -> "n_zN6g8_zkIhvAV65zujq3_1";
  "n_zN6g8_zkIhvAV65zujq3_38" -> "n_zN6g8_zkIhvAV65zujq3_40";
  "n_zN6g8_zkIhvAV65zujq3_40" -> "n_zN6g8_zkIhvAV65zujq3_38";
  "n_zN6g8_zkIhvAV65zujq3_40" -> "n_zN6g8_zkIhvAV65zujq3_42";
  "n_zN6g8_zkIhvAV65zujq3_42" -> "n_zN6g8_zkIhvAV65zujq3_46";
  "n_zN6g8_zkIhvAV65zujq3_50" -> "n_zN6g8_zkIhvAV65zujq3_51";
  "n_zN6g8_zkIhvAV65zujq3_50" -> "n_zN6g8_zkIhvAV65zujq3_42";
  "n_zN6g8_zkIhvAV65zujq3_51" -> "n_zN6g8_zkIhvAV65zujq3_58";
  "n_zN6g8_zkIhvAV65zujq3_58" -> "n_zN6g8_zkIhvAV65zujq3_139";
  "n_zN6g8_zkIhvAV65zujq3_139" -> "n_zN6g8_zkIhvAV65zujq3_51";
  "n_zN6g8_zkIhvAV65zujq3_139" -> "n_zN6g8_zkIhvAV65zujq3_63";
  "n_zN6g8_zkIhvAV65zujq3_63" -> "n_Z8cy0SIaxi_QjKJotWLw_20";
  "n_Z8cy0SIaxi_QjKJotWLw_26" -> "n_Z8cy0SIaxi_QjKJotWLw_28";
  "n_Z8cy0SIaxi_QjKJotWLw_26" -> "n_zN6g8_zkIhvAV65zujq3_63";
  "n_Z8cy0SIaxi_QjKJotWLw_28" -> "n_Z8cy0SIaxi_QjKJotWLw_30";
  "n_Z8cy0SIaxi_QjKJotWLw_30" -> "n_Z8cy0SIaxi_QjKJotWLw_36";
  "n_Z8cy0SIaxi_QjKJotWLw_36" -> "n_Z8cy0SIaxi_QjKJotWLw_28";
  "n_Z8cy0SIaxi_QjKJotWLw_36" -> "n_Z8cy0SIaxi_QjKJotWLw_33";
  "n_Z8cy0SIaxi_QjKJotWLw_33" -> "n_Z8cy0SIaxi_QjKJotWLw_77";
  "n_Z8cy0SIaxi_QjKJotWLw_83" -> "n_Z8cy0SIaxi_QjKJotWLw_85";
  "n_Z8cy0SIaxi_QjKJotWLw_83" -> "n_Z8cy0SIaxi_QjKJotWLw_33";
  "n_Z8cy0SIaxi_QjKJotWLw_85" -> "n_Z8cy0SIaxi_QjKJotWLw_87";
  "n_Z8cy0SIaxi_QjKJotWLw_87" -> "n_Z8cy0SIaxi_QjKJotWLw_93";
  "n_Z8cy0SIaxi_QjKJotWLw_93" -> "n_Z8cy0SIaxi_QjKJotWLw_85";
  "n_Z8cy0SIaxi_QjKJotWLw_93" -> "n_Z8cy0SIaxi_QjKJotWLw_90";
  "n_Z8cy0SIaxi_QjKJotWLw_90" -> "n_Z8cy0SIaxi_QjKJotWLw_95";
  "n_Z8cy0SIaxi_QjKJotWLw_101" -> "n_Z8cy0SIaxi_QjKJotWLw_103";
  "n_Z8cy0SIaxi_QjKJotWLw_101" -> "n_Z8cy0SIaxi_QjKJotWLw_90";
  "n_Z8cy0SIaxi_QjKJotWLw_103" -> "n_Z8cy0SIaxi_QjKJotWLw_105";
  "n_Z8cy0SIaxi_QjKJotWLw_105" -> "n_Z8cy0SIaxi_QjKJotWLw_111";
  "n_Z8cy0SIaxi_QjKJotWLw_111" -> "n_Z8cy0SIaxi_QjKJotWLw_103";
  "n_Z8cy0SIaxi_QjKJotWLw_111" -> "n_Z8cy0SIaxi_QjKJotWLw_108";
  "n_Z8cy0SIaxi_QjKJotWLw_119" -> "n_Z8cy0SIaxi_QjKJotWLw_121";
  "n_Z8cy0SIaxi_QjKJotWLw_121" -> "n_Z8cy0SIaxi_QjKJotWLw_123";
  "n_Z8cy0SIaxi_QjKJotWLw_123" -> "n_Z8cy0SIaxi_QjKJotWLw_129";
  "n_Z8cy0SIaxi_QjKJotWLw_129" -> "n_Z8cy0SIaxi_QjKJotWLw_121";
  "n_Z8cy0SIaxi_QjKJotWLw_129" -> "n_zN6g8_zkIhvAV65zujq3_1";
}
